Repository: weld/core
Catalog: docs/reference/src/main/docbook/*/environments.po
Languages: pt_br

source: Application servers and environments supported by Weld
pt_br: Servidores de aplicação e ambientes suportados pelo Weld

source: Using Weld with JBoss AS
pt_br: Utilizando Weld com o JBoss AS

source: If you are using JBoss AS 6.0, no additional configuration is required to use Weld (or CDI for that matter). All you need to do is make your application a bean bean archive by adding <literal>META-INF/beans.xml</literal> to the classpath or <literal>WEB-INF/beans.xml</literal> to the web root!
pt_br: Se você está usando JBoss AS 6.0, nenhuma configuração adicional é necessária para usar Weld (ou CDI para este caso). Tudo que você precisa fazer é tornar sua aplicação em um bean archive adicionando <literal>META-INF/beans.xml</literal> ao classpath ou <literal>WEB-INF/beans.xml</literal> à raiz web!

source: Additionally, Weld Servlet supports JBoss EAP 5.1, to do this use the <literal>jboss5</literal> variant of Weld Servlet.
pt_br: Adicionalmente, a Servlet do Weld suporta o JBoss EAP 5.1, usando a variante <literal>jboss5</literal> da Servlet do Weld.

source: Weld is also built into GlassFish from V3 onwards. Since GlassFish V3 is the Java EE 6 reference implementation, it must support all features of CDI. What better way for GlassFish to support these features than to use Weld, the JSR-299 reference implementation? Just package up your CDI application and deploy.
pt_br: O Weld também está embutido no GlassFish a partir da V3 e posteriores. Já que o GlassFish V3 é a implementação de referência da Java EE 6, ele deve suportar todas as funcionalidades da CDI. Qual a melhor maneira para que o GlassFish suporte estas funcionalidade do que usar Weld, a implementação de referência da JSR-299? Apenas empacote sua aplicação CDI e implante.

source: Servlet containers (such as Tomcat or Jetty)
pt_br: Servlet containers (como o Tomcat ou Jetty)

source: While JSR-299 does not require support for servlet environments, Weld can be used in a servlet container, such as Tomcat 6.0 or Jetty 6.1.
pt_br: Enquanto a JSR-299 não requer suporte a ambientes servlet, o Weld pode ser utilizado em qualquer contêiner Servlet, como o Tomcat 6.0 ou Jetty 6.1.

source: There is a major limitation to using a servlet container. Weld doesn't support deploying session beans, injection using <literal>@EJB</literal> or <literal>@PersistenceContext</literal>, or using transactional events in servlet containers. For enterprise features such as these, you should really be looking at a Java EE application server.
pt_br: Há uma limitação maior no uso de um contêiner servlet. O Weld não suporta a implantação de session beans, injeção usando <literal>@EJB</literal> ou <literal>@PersistenceContext</literal>, ou a utilização de eventos transacionais em contêineres servlet. Para funcionalidades corporativas como estas, você deveria realmente procurar um servidor de aplicações Java EE.

source: Weld can be used as a library in an web application that is deployed to a Servlet container. You should place <literal>weld-servlet.jar</literal> within the <literal>WEB-INF/lib</literal> directory relative to the web root. <literal>weld-servlet.jar</literal> is an "uber-jar", meaning it bundles all the bits of Weld and CDI required for running in a Servlet container, for your convenience. Alternatively, you can use its component jars. A list of transitive dependencies can be found in the <literal>META-INF/DEPENDENCIES.txt</literal> file inside the <literal>weld-servlet.jar</literal> artifact.
pt_br: O Weld pode ser usado como uma biblioteca de aplicação web em um contêiner Servlet. Você deve colocar <literal>weld-servlet.jar</literal> dentro do diretório <literal>WEB-INF/lib</literal> relativo à raiz web. <literal>weld-servlet.jar</literal> é um "uber-jar", significando que ele empacota todas as partes do Weld e CDI necessárias para rodar em um contêiner servlet, para sua conveniência. Alternativamente, você pode usar seus jars componentes. Uma lista de dependências pode ser encontrada no arquivo <literal>META-INF/DEPENDENCIES.txt</literal> dentro do artefato <literal>weld-servlet.jar</literal>.

source: You also need to explicitly specify the servlet listener (used to boot Weld, and control its interaction with requests) in <literal>WEB-INF/web.xml</literal> in the web root:
pt_br: Você também precisa especificar explicitamente o servlet listener (usado para iniciar o Weld e controlar a interação com as requisições) no <literal>web.xml</literal>:

source: Tomcat has a read-only JNDI, so Weld can't automatically bind the BeanManager extension SPI. To bind the BeanManager into JNDI, you should populate <literal>META-INF/context.xml</literal> in the web root with the following contents:
pt_br: O Tomcat possui um JNDI somente leitura, assim o Weld não pode vincular automaticamente a extensão SPI do BeanManager. Para vincular o BeanManager ao JNDI, você deve preencher <literal>META-INF/context.xml</literal> na raiz web com o seguinte conteúdo:

source: and make it available to your deployment by adding this to the bottom of <literal>web.xml</literal>:
pt_br: e torná-lo disponível para a sua implantação, acrescentando isto no final do <literal>web.xml</literal>:

source: Tomcat only allows you to bind entries to <literal>java:comp/env</literal>, so the BeanManager will be available at <literal>java:comp/env/BeanManager</literal>
pt_br: O Tomcat somente permite que você vincule entradas em <literal>java:comp/env</literal>, assim o BeanManager estará disponível em <literal>java:comp/env/BeanManager</literal>

source: Weld also supports Servlet injection in Tomcat 6.
pt_br: Weld também suporta injeção de Servlet no Tomcat 6.

source: Like Tomcat, Jetty has a read-only JNDI, so Weld can't automatically bind the BeanManager. To bind the BeanManager to JNDI in Jetty 6, you should populate <literal>WEB-INF/jetty-env.xml</literal> with the following contents:
pt_br: Como o Tomcat, o Jetty possui um JNDI somente leitura, assim o Weld não pode vincular automaticamente o BeanManager. Para vincular o BeanManager ao JNDI no Jetty 6, você deve preencher <literal>WEB-INF/jetty-env.xml</literal> com o seguinte conteúdo:

source: Jetty 7 has moved to the Eclipse Foundation; if you are using Jetty 7 put the following in your <literal>WEB-INF/jetty-env.xml</literal>:
pt_br: O Jetty 7 foi movido para a Fundação Eclipse; se você está usando o Jetty 7 coloque o seguinte conteúdo em seu <literal>WEB-INF/jetty-env.xml</literal>:

source: Just like in Tomcat, you need to make it available to your deployment by adding this to the bottom of <literal>web.xml</literal>:
pt_br: Assim como no Tomcat, você precisa torná-lo disponível em sua implantação, acrescentando isto ao final do <literal>web.xml</literal>:

source: Notice that Jetty doesn't not have built-in support for an <literal>javax.naming.spi.ObjectFactory</literal> like Tomcat, so it's necessary to manually create the <literal>javax.naming.Reference</literal> to wrap around it.
pt_br: Note que o Jetty não possui suporte já existente a um <literal>javax.naming.spi.ObjectFactory</literal> como o Tomcat, assim é necessário criar manualmente o <literal>javax.naming.Reference</literal> para envolvê-lo.

source: Jetty only allows you to bind entries to <literal>java:comp/env</literal>, so the BeanManager will be available at <literal>java:comp/env/BeanManager</literal>
pt_br: O Jetty somente permite que você vincule entradas em <literal>java:comp/env</literal>, assim o BeanManager estará disponível em <literal>java:comp/env/BeanManager</literal>

source: Weld also supports Servlet injection in Jetty 6. To enable this, add the file <literal>WEB-INF/jetty-web.xml</literal> with the following content to your war:
pt_br: O Weld também suporta injeção em Servlet no Jetty 6. Para habilitar isto, adicione o arquivo <literal>META-INF/jetty-web.xml</literal> com o seguinte conteúdo em seu war:

source: In addition to improved integration of the Enterprise Java stack, the "Contexts and Dependency Injection for the Java EE platform" specification also defines a state of the art typesafe, stateful dependency injection framework, which can prove useful in a wide range of application types. To help developers take advantage of this, Weld provides a simple means for being executed in the Java Standard Edition (SE) environment independently of any Java EE APIs.
pt_br: Em adição a uma integração melhorada da pilha Java Enterprise, a especificação "Contexts and Dependency Injection for the Java EE platform" também define um framework de injeção de dependência em estado da arte e typesafe, o qual pode se comprovar útil em uma ampla variedade de tipos de aplicação. Para ajudar desenvolvedores tirar vantagem disto, o Weld fornece um meio simples de ser executado no ambiente Java Standard Edition (SE) independentemente de qualquer API da Java EE.

source: When executing in the SE environment the following features of Weld are available:
pt_br: Quando executando no ambiente SE as seguintes funcionalidades do Weld estão disponíveis:

source: Managed beans with <literal>@PostConstruct</literal> and <literal>@PreDestroy</literal> lifecycle callbacks
pt_br: Managed beans com os callbacks <literal>@PostConstruct</literal> e <literal>@PreDestroy</literal> do ciclo de vida

source: Dependency injection with qualifiers and alternatives
pt_br: Injeção de dependência com qualificadores e alternativos

source: <literal>@Application</literal>, <literal>@Dependent</literal> and <literal>@Singleton</literal> scopes
pt_br: Os escopos <literal>@Application</literal>, <literal>@Dependent</literal> e <literal>@Singleton</literal>

source: Interceptors and decorators
pt_br: Interceptadores e decoradores

source: Stereotypes
pt_br: Estereótipos

source: Events
pt_br: Eventos

source: Portable extension support
pt_br: Suporte a extensão portável

source: EJB beans are not supported.
pt_br: Beans EJB não são suportados.

source: CDI SE Module
pt_br: Módulo CDI SE

source: Weld provides an extension which will boot a CDI bean manager in Java SE, automatically registering all simple beans found on the classpath. The command line parameters can be injected using either of the following:
pt_br: O Weld fornece uma extensão que inicializa um gerenciador de beans CDI em Java SE, registrando automaticamente todos os beans simples encontrados no classpath. Os parâmetros de linha de comando podem ser injetados usando uma das seguintes formas:

source: The second form is useful for compatibility with existing classes.
pt_br: A segunda forma é útil para compatibilidade com classes existentes.

source: The command line parameters do not become available for injection until the <literal>ContainerInitialized</literal> event is fired. If you need access to the parameters during initialization you can do so via the <literal>public static String[] getParameters()</literal> method in <literal>StartMain</literal>.
pt_br: Os parâmetros de linha de comando não ficaram disponíveis para injeção até que o evento <literal>ContainerInitialized</literal> seja disparado. Se você precisa acessar os parâmetros durante a inicialização você pode fazer assim por meio do método <literal>public static String[] getParameters()</literal> em <literal>StartMain</literal>.

source: Here's an example of a simple CDI SE application:
pt_br: Aqui está um exemplo de uma simples aplicação CDI SE:

source: Bootstrapping CDI SE
pt_br: Inicializando aplicações CDI SE

source: CDI SE applications can be bootstrapped in the following ways.
pt_br: Aplicações CDI SE podem ser inicializadas das seguintes maneiras.

source: The ContainerInitialized Event
pt_br: O Evento ContainerInitialized

source: Thanks to the power of CDI's typesafe event model, application developers need not write any bootstrapping code. The Weld SE module comes with a built-in main method which will bootstrap CDI for you and then fire a <literal>ContainerInitialized</literal> event. The entry point for your application code would therefore be a simple bean which observes the <literal>ContainerInitialized</literal> event, as in the previous example.
pt_br: Devido ao poder do modelo de eventos typesafe de CDI, desenvolvedores de aplicação não precisam escrever qualquer código de inicialização. O módulo Weld SE vem com um método main embutido que inicializa o CDI para você e então dispara um evento <literal>ContainerInitialized</literal>. O ponto de entrada para o código de sua aplicação seria, portanto, um simples bean que observa o evento <literal>ContainerInitialized</literal>, como no exemplo anterior.

source: In this case your application can be started by calling the provided main method like so:
pt_br: Neste caso sua aplicação pode ser iniciada chamando o método main fornecido como este:

source: Programmatic Bootstrap API
pt_br: API de Inicialização Programática

source: For added flexibility, CDI SE also comes with a bootstrap API which can be called from within your application in order to initialize CDI and obtain references to your application's beans and events. The API consists of two classes: <literal>Weld</literal> and <literal>WeldContainer</literal>.
pt_br: Para adicionar flexibilidade, CDI SE também vem com uma API de inicialização que pode ser chamada dentro de sua aplicação para inicializar a CDI e obter referências para os beans e eventos de sua aplicação. A API consiste em duas classes: <literal>Weld</literal> e <literal>WeldContainer</literal>.

source: public class Weld { /** Boots Weld and creates and returns a WeldContainer instance, through which * beans and events can be accesed. */ public WeldContainer initialize() {...} /** Convenience method for shutting down the container. */ public void shutdown() {...} }
pt_br: public class Weld { /** Inicia o Weld, cria e retorna uma instância de WeldContainer, por meio do qual * os beans e events podem ser acessados. */ public WeldContainer initialize() {...} /** Método conveniente para encerramento do contêiner. */ public void shutdown() {...} }

source: public class WeldContainer { /** Provides access to all beans within the application. */ public Instance&lt;Object&gt; instance() {...} /** Provides access to all events within the application. */ public Event&lt;Object&gt; event() {...} /** Provides direct access to the BeanManager. */ public BeanManager getBeanManager() {...} }
pt_br: public class WeldContainer { /** Fornece acesso a todos os beans dentro da aplicação. */ public Instance&lt;Object&gt; instance() {...} /** Fornece acesso a todos os events dentro da aplicação. */ public Event&lt;Object&gt; event() {...} /** Fornece acesso direto ao BeanManager. */ public BeanManager getBeanManager() {...} }

source: Here's an example application main method which uses this API to initialize a bean of type <literal>MyApplicationBean</literal>.
pt_br: Aqui está um método main da aplicação de exemplo que usa esta API para inicializar um bean do tipo <literal>MyApplicationBean</literal>.

source: Alternatively the application could be started by firing a custom event which would then be observed by another simple bean. The following example fires <literal>MyEvent</literal> on startup.
pt_br: Alternativamente a aplicação poderia ser iniciada ao disparar um evento personalizado que, então, seria observado por um outro simples bean. O seguinte exemplo dispara <literal>MyEvent</literal> na inicialização.

source: In contrast to Java EE applications, Java SE applications place no restrictions on developers regarding the creation and usage of threads. Therefore Weld SE provides a custom scope annotation, <literal>@ThreadScoped</literal>, and corresponding context implementation which can be used to bind bean instances to the current thread. It is intended to be used in scenarios where you might otherwise use <literal>ThreadLocal</literal>, and does in fact use <literal>ThreadLocal</literal> under the hood.
pt_br: Em contraste com aplicações Java EE, aplicações Java SE coloca nenhuma restrição aos desenvolvedores a respeito da criação e uso de threads. Por isso o Weld SE fornece uma anotação de escopo específico, <literal>@ThreadScoped</literal>, e uma correspondente implementação de contexto que pode ser usada para vincular instâncias de beans à thread corrente. É destinada a ser usada em cenários onde você poderia usar <literal>ThreadLocal</literal>, e de fato fará uso de <literal>ThreadLocal</literal>, mas por baixo dos panos.

source: To use the @ThreadScoped annotation you need to enable the <literal>RunnableDecorator</literal> which 'listens' for all executions of <literal>Runnable.run()</literal> and decorates them by setting up the thread context beforehand, bound to the current thread, and destroying the context afterwards.
pt_br: Para usar a anotação @ThreadScoped você precisa habilitar o <literal>RunnableDecorator</literal> que 'ouve' todas as execuções de <literal>Runnable.run()</literal> e decora elas configurando o contexto de thread antecipadamente, delimitando a thread corrente e destruindo o contexto mais tarde.

source: It is not necessary to use @ThreadScoped in all multithreaded applications. The thread context is not intended as a replacement for defining your own application-specific contexts. It is generally only useful in situations where you would otherwise have used ThreadLocal directly, which are typically rare.
pt_br: Não é necessário usar @ThreadScoped em todas aplicações multithreaded. O contexto de thread não é destinado como um substituição a definir seus próprios cotextos específicos da aplicação. Somente é geralmente útil em situações onde você teria utilizado ThreadLocal diretamente, as quais são tipicamente raras.

source: Setting the Classpath
pt_br: Configurando o Classpath

source: Weld SE comes packaged as a 'shaded' jar which includes the CDI API, Weld Core and all dependant classes bundled into a single jar. Therefore the only Weld jar you need on the classpath, in addition to your application's classes and dependant jars, is the Weld SE jar. If you are working with a pure Java SE application you launch using <literal>java</literal>, this may be simpler for you.
pt_br: O Weld SE vem empacotado como um jar 'iluminado' que inclui a API CDI, o Weld Core e todas classes dependentes agrupadas em um único jar. Por esse motivo o único jar do Weld que você precisa no classpath, em adição às classes e jars dependentes de sua aplicação, é o jar do Weld SE. Se você está trabalhando com uma aplicação Java SE pura você lançará ela usando <literal>java</literal> e isto pode ser mais simples para você.

source: If you prefer to work with individual dependencies, then you can use the <literal>weld-core</literal> jar which just contains the Weld SE classes. Of course in this mode you will need to assemble the classpath yourself. This mode is useful, for example, if you wish to use an alternative slf4j log binding.
pt_br: Se você prefere trabalhar com dependências individuais, então você pode usar o jar <literal>weld-core</literal> que contém apenas as classes do Weld SE. Certamente neste modo você precisará montar o classpath você mesmo. Este modo é útil, por exemplo, se você deseja usar um slf4j alternativo.

source: If you work with a dependency management solution such as Maven you can declare a dependency on <literal>org.jboss.weld.se:weld-se-core</literal>.
pt_br: Se você trabalha com uma solução de gerenciamento de dependências como o Maven, você pode declarar uma dependência com <literal>org.jboss.weld.se:weld-se-core</literal>.
