Repository: weld/core
Catalog: reference/*/producermethods.po
Languages: it_it

source: Producer methods
it_it: Metodi produttori

source: Producer methods let us overcome certain limitations that arise when the Web Bean manager, instead of the application, is responsible for instantiating objects. They're also the easiest way to integrate objects which are not Web Beans into the Web Beans environment. (We'll meet a second approach in <xref linkend="xml"/>.)
it_it: I metodi produttori consentono di superare alcune limitazioni che sorgono quando il manager Web Bean è responsabile dell'istanziamento degli oggetti al posto dell'applicazione. Questi metodi sono anche il modo migliore per integrare gli oggetti che non sono Web Beans dentro l'ambiente Web Beans. (Si incontrerà un secondo approccio in <xref linkend="xml"/>.)

source: According to the spec:
it_it: Secondo la specifica:

source: <blockquote> <para>A Web Beans producer method acts as a source of objects to be injected, where:</para> <itemizedlist> <listitem> <para>the objects to be injected are not required to be instances of Web Beans,</para> </listitem> <listitem> <para>the concrete type of the objects to be injected may vary at runtime or</para> </listitem> <listitem> <para>the objects require some custom initialization that is not performed by the Web Bean constructor</para> </listitem> </itemizedlist> </blockquote> <para>For example, producer methods let us:</para> <itemizedlist> <listitem> <para>expose a JPA entity as a Web Bean,</para> </listitem> <listitem> <para>expose any JDK class as a Web Bean,</para> </listitem> <listitem> <para>define multiple Web Beans, with different scopes or initialization, for the same implementation class, or</para> </listitem> <listitem> <para>vary the implementation of an API type at runtime.</para> </listitem> </itemizedlist> <para>In particular, producer methods let us use runtime polymorphism with Web Beans. As we've seen, deployment types are a powerful solution to the problem of deployment-time polymorphism. But once the system is deployed, the Web Bean implementation is fixed. A producer method has no such limitation:</para> <programlisting role="JAVA"><![CDATA[@SessionScoped public class Preferences { private PaymentStrategyType paymentStrategy; ... @Produces @Preferred public PaymentStrategy getPaymentStrategy() { switch (paymentStrategy) { case CREDIT_CARD: return new CreditCardPaymentStrategy(); case CHEQUE: return new ChequePaymentStrategy(); case PAYPAL: return new PayPalPaymentStrategy(); default: return null; } } }]]></programlisting> <para>Consider an injection point:</para> <programlisting role="JAVA"><![CDATA[@Preferred PaymentStrategy paymentStrat;]]></programlisting> <para>This injection point has the same type and binding annotations as the producer method, so it resolves to the producer method using the usual Web Beans injection rules. The producer method will be called by the Web Bean manager to obtain an instance to service this injection point.</para>.
it_it: <blockquote> <para>Un metodo produttore Web Bean agisce come sorgente di oggetti da iniettare, dove:</para> <itemizedlist> <listitem> <para>gli oggetti da iniettare non è richiesto siano istanze di Web Beans,</para> </listitem> <listitem> <para>il tipo concreto di oggetti da iniettare può variare a runtime o</para> </listitem> <listitem> <para>gli oggetti richiedono alcune inizializzazini personalizzate che non vengono eseguite dal costruttore Web Bean</para> </listitem> </itemizedlist> </blockquote> <para>Per esempio un metodo produttore consente di:</para> <itemizedlist> <listitem> <para>esporre un entity JPA comeWeb Bean,</para> </listitem> <listitem> <para>esporre qualsiasi classe JDK comeWeb Bean,</para> </listitem> <listitem> <para>definire Web Beans multipli, con scope o inizializzazione differenti, per la stessa implementazionedi classe, o</para> </listitem> <listitem> <para>variare l'implementazione di un tipo di API a runtime.</para> </listitem> </itemizedlist> <para>In particolare, i metodi produttori consentono di usare un polimorfismo a runtime con i Web Beans. Come visto, i tipi di deploy sono soluzioni al problema del polimorfismo durante la fase di deploy. Ma una volta che il sistema viene deployato, l'implementazione del Web Bean viene fissata. Un metodo produttore non ha questi limiti:</para> <programlisting role="JAVA"><![CDATA[@SessionScoped public class Preferences { private PaymentStrategyType paymentStrategy; ... @Produces @Preferred public PaymentStrategy getPaymentStrategy() { switch (paymentStrategy) { case CREDIT_CARD: return new CreditCardPaymentStrategy(); case CHEQUE: return new ChequePaymentStrategy(); case PAYPAL: return new PayPalPaymentStrategy(); default: return null; } } }]]></programlisting> <para>Si consideri un punto di iniezione:</para> <programlisting role="JAVA"><![CDATA[@Preferred PaymentStrategy paymentStrat;]]></programlisting> <para>Questo punto di iniezione ha lo stesso tipo e annotazioni di binding del metodo produttore, e quindi risolve i metodi produttori usando le regole di iniezione dei Web Beans. Il metodo produttore verrà chiamato dal manager Web Bean per ottenere un'istanza per per servire questo punto di iniezione.</para>

source: Scope of a producer method
it_it: Scope di un metodo produttore

source: The scope of the producer method defaults to <literal>@Dependent</literal>, and so it will be called <emphasis>every time</emphasis> the Web Bean manager injects this field or any other field that resolves to the same producer method. Thus, there could be multiple instances of the <literal>PaymentStrategy</literal> object for each user session.
it_it: Lo scope dei metodi produttori è di default impostato a <literal>@Dependent</literal>, e quindi verrà chiamato <emphasis>ogni volta</emphasis> che il manager Web Bean inietta questo campo o qualsiasi altro campi che risolve lo stesso metodo produttore. Quindi ci potrebbero essere istanze multiple dell'oggetto <literal>PaymentStrategy</literal> per ogni sessione utente.

source: To change this behavior, we can add a <literal>@SessionScoped</literal> annotation to the method.
it_it: Per cambiare questo comportamento si può aggiungere un'annotazione <literal>@SessionScoped</literal> al metodo.

source: Now, when the producer method is called, the returned <literal>PaymentStrategy</literal> will be bound to the session context. The producer method won't be called again in the same session.
it_it: Ora, quando il metodo produttore viene chiamato, il <literal>PaymentStrategy</literal> restituito verrà associato al contesto di sessione. Il metodo produttore non verrà più chiamato nella stessa sessione.

source: Injection into producer methods
it_it: Iniezione nei metodi produttori

source: There's one potential problem with the code above. The implementations of <literal>CreditCardPaymentStrategy</literal> are instantiated using the Java <literal>new</literal> operator. Objects instantiated directly by the application can't take advantage of dependency injection and don't have interceptors.
it_it: C'è un potenziale problema con il codice visto sopra. Le implementazioni di <literal>CreditCardPaymentStrategy</literal> vengono istanziate usando l'operatore Java <literal>new</literal>. Gli oggetti istanziati direttamente dall'applicazione non possono sfruttare la dependency injection e non hanno interceptor.

source: If this isn't what we want we can use dependency injection into the producer method to obtain Web Bean instances:
it_it: Se questo non è ciò che si vuole, è possibile usare la dependency injection nel metodo produttore per ottenere istanze Web Bean:

source: Wait, what if <literal>CreditCardPaymentStrategy</literal> is a request scoped Web Bean? Then the producer method has the effect of "promoting" the current request scoped instance into session scope. This is almost certainly a bug! The request scoped object will be destroyed by the Web Bean manager before the session ends, but the reference to the object will be left "hanging" in the session scope. This error will <emphasis>not</emphasis> be detected by the Web Bean manager, so please take extra care when returning Web Bean instances from producer methods!
it_it: Ma cosa succede se <literal>CreditCardPaymentStrategy</literal> è un Web Bean con scope di tipo richiesta? Il metodo produttore ha l'effetto di "promuovere" l'istanza corrente con scope di tipo richiesta a scope di tipo sessione. Questo è quasi certamente un bug! L'oggetto con scope richiesta verrà distrutto dal manager Web Bean prima che la sessione termini. Quest'errore <emphasis>non</emphasis> verrà rilevato dal manager Web Bean, quindi si faccia attenzione quando si restituiscono istanze Web Bean dai metodi produttori!

source: There's at least three ways we could go about fixing this bug. We could change the scope of the <literal>CreditCardPaymentStrategy</literal> implementation, but this would affect other clients of that Web Bean. A better option would be to change the scope of the producer method to <literal>@Dependent</literal> or <literal>@RequestScoped</literal>.
it_it: Ci sono almeno 3 modi per correggere questo bug. Si può cambiare lo scope dell'implementazione di <literal>CreditCardPaymentStrategy</literal>, ma questo non influenzerebbe gli altri client di questo Web Bean. Un'opzione migliore sarebbe quella di cambiare lo scope del metodo produttore a <literal>@Dependent</literal> o <literal>@RequestScoped</literal>.

source: But a more common solution is to use the special <literal>@New</literal> binding annotation.
it_it: Ma una soluzione più comune è quella di usare la speciale annotazione di binding <literal>@New</literal>.

source: Use of <literal>@New</literal> with producer methods
it_it: Uso di <literal>@New</literal> con i metodi produttori

source: Consider the following producer method:
it_it: Si consideri il seguente metodo produttore:

source: Then a new <emphasis>dependent</emphasis> instance of <literal>CreditCardPaymentStrategy</literal> will be created, passed to the producer method, returned by the producer method and finally bound to the session context. The dependent object won't be destroyed until the <literal>Preferences</literal> object is destroyed, at the end of the session.
it_it: Quindi verrebbe creata una nuova istanza <emphasis>dipendente</emphasis> di <literal>CreditCardPaymentStrategy</literal>, passata al metodo produttore, ritornata al metodo produttore ed infine associata al contesto di sessione. L'oggetto dipendente non verrebbe distrutto finché l'oggetto <literal>Preferences</literal> non venga distrutto, cioè a fine sessione.
